<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads the latest version of Mosh.</string>
        <key>Identifier</key>
        <string>com.github.grumpydrew.download.Mosh</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>mosh</string>
            <key>RELEASE</key>
            <string>latest</string>
        </dict>
        <key>MinimumVersion</key>
        <string>0.6.0</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Processor</key>
                <string>URLTextSearcher</string>
                <key>Arguments</key>
                <dict>
                    <key>url</key>
                    <string>https://mosh.org</string>
                    <key>re_pattern</key>
                    <string>mosh-([0-9\.]+).pkg</string>
                    <key>result_output_var_name</key>
                    <string>version</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>URLDownloader</string>
                <key>Arguments</key>
                <dict>
                    <key>url</key>
                    <string>%url%/mosh-%version%.pkg</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>EndOfCheckPhase</string>
            </dict>
        </array>
    </dict>
</plist>
