<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads and installs the latest version of Mosh.</string>
        <key>Identifier</key>
        <string>com.github.grumpydrew.install.Mosh</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>Mosh</string>
        </dict>
        <key>MinimumVersion</key>
        <string>0.4.0</string>
        <key>ParentRecipe</key>
        <string>com.github.grumpydrew.download.Mosh</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>pkg_path</key>
                    <string>%pathname%</string>
                </dict>
                <key>Processor</key>
                <string>Installer</string>
            </dict>
        </array>
    </dict>
</plist>
