<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Download recipe for Pexip Infinity Connect.</string>
    <key>Identifier</key>
    <string>com.github.grumpydrew.download.PexipInfinityConnect</string>
    <key>Input</key>
    <dict>
    	<key>NAME</key>
    	<string>PexipInfinityConnect</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.0</string>
    <key>Process</key>
    <array>
    	<dict>
    		<key>Processor</key>
    		<string>URLTextSearcher</string>
    		<key>Arguments</key>
    		<dict>
    			<key>url</key>
    			<string>https://support.pexip.com/hc/en-us/articles/360015877891-Infinity-Connect-Client-Download</string>
    			<key>re_pattern</key>
    			<string>(?P&lt;url&gt;http://.*darwin.*\.dmg)</string>
    		</dict>
    	</dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>%NAME%.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/Pexip Infinity Connect.app</string>
                <key>requirement</key>
                <string>identifier "com.pexip.infinity-connect" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = U7E3T6C2S4</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
