<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest UNIVERSAL binary for Brave.</string>
    <key>Identifier</key>
    <string>com.github.grumpydrew.download.Brave</string>
    <key>Input</key>
    <dict>
    	<key>NAME</key>
    	<string>Brave</string>
    	<key>DOWNLOAD_URL</key>
    	<string>https://laptop-updates.brave.com/latest/osx</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.0</string>
    <key>Process</key>
    <array>
    	<dict>
    		<key>Processor</key>
    		<string>URLDownloader</string>
    		<key>Arguments</key>
    		<dict>
    			<key>url</key>
    			<string>%DOWNLOAD_URL%</string>
    			<key>filename</key>
    			<string>%NAME%.dmg</string>
    		</dict>
    	</dict>
    	<dict>
    		<key>Processor</key>
    		<string>EndOfCheckPhase</string>
    	</dict>
    	<dict>
    		<key>Processor</key>
    		<string>CodeSignatureVerifier</string>
    		<key>Arguments</key>
    		<dict>
    			<key>input_path</key>
    			<string>%pathname%/Brave Browser.app</string>
    			<key>requirement</key>
    			<string>identifier "com.brave.Browser" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */</string>
    		</dict>
    	</dict>
    </array>
</dict>
</plist>