<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Download recipe for Lucifer.</string>
    <key>Identifier</key>
    <string>com.github.grumpydrew.download.lucifer</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>lucifer</string>
        <key>URL</key>
        <string>https://www.hexedbits.com/downloads</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>DeprecationWarning</string>
            <key>Arguments</key>
            <dict>
                <key>warning_message</key>
                <string>Lucifer app downloads are now gated behind a payment system. This recipe is deprecated and will be removed in the future.</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%URL%/%NAME%.zip</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
        <key>Processor</key>
          <string>Unarchiver</string>
          <key>Arguments</key>
          <dict>
              <key>archive_path</key>
              <string>%RECIPE_CACHE_DIR%/downloads/%NAME%.zip</string>
              <key>destination_path</key>
              <string>%RECIPE_CACHE_DIR%/%NAME%</string>
              <key>purge_destination</key>
              <true/>
          </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%/Lucifer.app</string>
                <key>requirement</key>
                <string>anchor apple generic and identifier "com.hexedbits.lucifer666" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "5VRJU68BZ5")</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
