<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Download recipe for IBM Notifier.</string>
        <key>Identifier</key>
        <string>com.github.grumpydrew.download.IBM_Notifier</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>IBM_Notifier</string>
        </dict>
        <key>MinimumVersion</key>
        <string>0.5.0</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Processor</key>
                <string>GitHubReleasesInfoProvider</string>
                <key>Arguments</key>
                <dict>
                    <key>asset_regex</key>
                    <string>IBM.Notifier.zip</string>
                    <key>github_repo</key>
                    <string>IBM/mac-ibm-notifications</string>
                </dict>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>filename</key>
                    <string>IBM.Notifier.zip</string>
                </dict>
                <key>Processor</key>
                <string>URLDownloader</string>
            </dict>
            <dict>
                <key>Processor</key>
                <string>EndOfCheckPhase</string>
            </dict>
            <dict>
            	<key>Processor</key>
            	<string>Unarchiver</string>
            	<key>Arguments</key>
            	<dict>
            		<key>archive_format</key>
            		<string>zip</string>
                	<key>archive_path</key>
                	<string>%RECIPE_CACHE_DIR%/downloads/%filename%</string>
                	<key>destination_path</key>
                	<string>%RECIPE_CACHE_DIR%/unzip</string>
                	<key>purge_destination</key>
                	<true/>
            	</dict>
        	</dict>
        	<dict>
    			<key>Processor</key>
    			<string>Versioner</string>
    			<key>Arguments</key>
    			<dict>
    				<key>input_plist_path</key>
    				<string>%RECIPE_CACHE_DIR%/unzip/IBM Notifier.app/Contents/Info.plist</string>
    			</dict>
    		</dict>
			<dict>
            	<key>Processor</key>
            	<string>PkgRootCreator</string>
            	<key>Arguments</key>
            	<dict>
                	<key>pkgroot</key>
                	<string>%RECIPE_CACHE_DIR%/%NAME%</string>
                	<key>pkgdirs</key>
                	<dict>
                    	<key>Applications/Utilities</key>
                    	<string>0775</string>
                	</dict>
            	</dict>
        	</dict>
        	<dict>
            	<key>Processor</key>
            	<string>Copier</string>
            	<key>Arguments</key>
            	<dict>
                	<key>source_path</key>
                	<string>%RECIPE_CACHE_DIR%/unzip/IBM Notifier.app</string>
                	<key>destination_path</key>
                	<string>%pkgroot%/Applications/Utilities/IBM Notifier.app</string>
            	</dict>
        	</dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>input_path</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%/Applications/Utilities/IBM Notifier.app</string>
                    <key>requirement</key>
                    <string>identifier "com.ibm.cio.notifier" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = PETKK2G752</string>
                </dict>
                <key>Processor</key>
                <string>CodeSignatureVerifier</string>
            </dict>
        </array>
    </dict>
</plist>
